[
  {
    "symbol": "AAPL",
    "price": 168.22,
    "beta": 1.308,
    "volAvg": 58829767,
    "mktCap": 2629985048637,
    "lastDiv": 0.96,
    "range": "124.17-198.23",
    "changes": 1.33,
    "companyName": "Apple Inc.",
    "currency": "USD",
    "cik": "0000320193",
    "isin": "US0378331005",
    "cusip": "037833100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Consumer Electronics",
    "website": "https://www.apple.com",
    "description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts. In addition, the company offers various services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was incorporated in 1977 and is headquartered in Cupertino, California.",
    "ceo": "Mr. Timothy D. Cook",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "164000",
    "phone": "408 996 1010",
    "address": "One Apple Park Way",
    "city": "Cupertino",
    "state": "CA",
    "zip": "95014",
    "dcfDiff": 4.15176,
    "dcf": 150.082,
    "image": "https://financialmodelingprep.com/image-stock/AAPL.png",
    "ipoDate": "1980-12-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "AAAU",
    "price": 19.88,
    "beta": 0.13,
    "volAvg": 1261404,
    "mktCap": 0,
    "lastDiv": 0,
    "range": "16.06-20.43",
    "changes": 0.22,
    "companyName": "Goldman Sachs Physical Gold ETF",
    "currency": "USD",
    "cik": "0001708646",
    "isin": "US38150K1034",
    "cusip": "38150K103",
    "exchange": "BATS",
    "exchangeShortName": "ETF",
    "industry": null,
    "website": null,
    "description": "The trust holds London Bars and Physical Gold of other specifications without numismatic value. It receives gold deposited by Authorized Participants in exchange for the creation of Baskets and delivers gold to Authorized Participants in exchange for Baskets surrendered to it for redemption.",
    "ceo": "",
    "sector": "",
    "country": "US",
    "fullTimeEmployees": null,
    "phone": "NA",
    "address": null,
    "city": null,
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AAAU.png",
    "ipoDate": "2018-08-15",
    "defaultImage": true,
    "isEtf": true,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "AAA",
    "price": 24.88,
    "beta": 0.08,
    "volAvg": 2540,
    "mktCap": 0,
    "lastDiv": 0.9179999999999999,
    "range": "24.08-25.24",
    "changes": -0.0059,
    "companyName": "AXS First Priority CLO Bond ETF",
    "currency": "USD",
    "cik": null,
    "isin": "US53656F6566",
    "cusip": null,
    "exchange": "New York Stock Exchange Arca",
    "exchangeShortName": "AMEX",
    "industry": null,
    "website": null,
    "description": "The fund is an actively-managed exchange-traded fund (“ETF”). Under normal circumstances, it invests at least 80% of its net assets (plus any borrowings for investment purposes) in AAA rated first priority debt tranches of U.S. dollar-dominated collateralized loan obligations (“CLOs”). It may invest in CLOs of any maturity. The fund is actively managed and does not seek to track the performance of any particular index.",
    "ceo": "",
    "sector": "",
    "country": "US",
    "fullTimeEmployees": null,
    "phone": "NA",
    "address": null,
    "city": null,
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AAA.png",
    "ipoDate": "2020-09-09",
    "defaultImage": false,
    "isEtf": true,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "AAU",
    "price": 0.1448,
    "beta": 1.008118,
    "volAvg": 214045,
    "mktCap": 20668462,
    "lastDiv": 0,
    "range": "0.11-0.28",
    "changes": 0.0042,
    "companyName": "Almaden Minerals Ltd.",
    "currency": "USD",
    "cik": "0001015647",
    "isin": "CA0202833053",
    "cusip": "020283305",
    "exchange": "American Stock Exchange",
    "exchangeShortName": "AMEX",
    "industry": "Gold",
    "website": "https://www.almadenminerals.com",
    "description": "Almaden Minerals Ltd., an exploration stage company, engages in the acquisition, exploration, evaluation, and development of mineral properties. It primarily owns a 100% interest in the Ixtaca gold-silver project located in Puebla State, Mexico. The company was incorporated in 1980 and is headquartered in Vancouver, Canada.",
    "ceo": "Dr. Morgan James Poliquin M.Sc., P.Eng.",
    "sector": "Basic Materials",
    "country": "CA",
    "fullTimeEmployees": "8",
    "phone": "16046897644",
    "address": "1333 Johnston Street",
    "city": "Vancouver",
    "state": "BC",
    "zip": "V6H 3R9",
    "dcfDiff": null,
    "dcf": 1.05971,
    "image": "https://financialmodelingprep.com/image-stock/AAU.png",
    "ipoDate": "2005-12-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "AFK",
    "price": 13.07,
    "beta": 0.96,
    "volAvg": 8201,
    "mktCap": 0,
    "lastDiv": 0.576,
    "range": "12.9611-17.67",
    "changes": 0.0088,
    "companyName": "VanEck Africa Index ETF",
    "currency": "USD",
    "cik": "0001137360",
    "isin": "US92189F8665",
    "cusip": "92189F866",
    "exchange": "New York Stock Exchange Arca",
    "exchangeShortName": "AMEX",
    "industry": null,
    "website": null,
    "description": "The fund normallyinvests at least 80% of its total assets in securities that comprise the fund’s benchmark index. The index includes securities of African companies. African companies generally include local listings of companies that are incorporated in Africa and listings of companies incorporated outside of Africa but that have at least 50% of their revenues/related assets in Africa.",
    "ceo": "",
    "sector": "",
    "country": "US",
    "fullTimeEmployees": null,
    "phone": "NA",
    "address": null,
    "city": null,
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AFK.png",
    "ipoDate": "2008-07-14",
    "defaultImage": true,
    "isEtf": true,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "MSFT",
    "price": 329.81,
    "beta": 0.899,
    "volAvg": 22154071,
    "mktCap": 2450409145600,
    "lastDiv": 3,
    "range": "213.43-366.78",
    "changes": 1.92,
    "companyName": "Microsoft Corporation",
    "currency": "USD",
    "cik": "0000789019",
    "isin": "US5949181045",
    "cusip": "594918104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.microsoft.com",
    "description": "Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide. The company operates in three segments: Productivity and Business Processes, Intelligent Cloud, and More Personal Computing. The Productivity and Business Processes segment offers Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, Microsoft Viva, and Skype for Business; Skype, Outlook.com, OneDrive, and LinkedIn; and Dynamics 365, a set of cloud-based and on-premises business solutions for organizations and enterprise divisions. The Intelligent Cloud segment licenses SQL, Windows Servers, Visual Studio, System Center, and related Client Access Licenses; GitHub that provides a collaboration platform and code hosting service for developers; Nuance provides healthcare and enterprise AI solutions; and Azure, a cloud platform. It also offers enterprise support, Microsoft consulting, and nuance professional services to assist customers in developing, deploying, and managing Microsoft server and desktop solutions; and training and certification on Microsoft products. The More Personal Computing segment provides Windows original equipment manufacturer (OEM) licensing and other non-volume licensing of the Windows operating system; Windows Commercial, such as volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; and Windows Internet of Things. It also offers Surface, PC accessories, PCs, tablets, gaming and entertainment consoles, and other devices; Gaming, including Xbox hardware, and Xbox content and services; video games and third-party video game royalties; and Search, including Bing and Microsoft advertising. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online stores, and retail stores. Microsoft Corporation was founded in 1975 and is headquartered in Redmond, Washington.",
    "ceo": "Mr. Satya  Nadella",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "221000",
    "phone": "425 882 8080",
    "address": "One Microsoft Way",
    "city": "Redmond",
    "state": "WA",
    "zip": "98052-6399",
    "dcfDiff": 4.56584,
    "dcf": 243.594,
    "image": "https://financialmodelingprep.com/image-stock/MSFT.png",
    "ipoDate": "1986-03-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "GTLB",
    "price": 42.24,
    "beta": 0,
    "volAvg": 1640981,
    "mktCap": 6454272000,
    "lastDiv": 0,
    "range": "26.24-58.7",
    "changes": 0.97,
    "companyName": "GitLab Inc.",
    "currency": "USD",
    "cik": "0001653482",
    "isin": "US37637K1088",
    "cusip": "37637K108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://about.gitlab.com",
    "description": "GitLab Inc., through its subsidiaries, develops software for the software development lifecycle in the United States, Europe, and the Asia Pacific. The company offers GitLab, a DevOps platform, which is a single application that leads to faster cycle time and allows visibility throughout and control over various stages of the DevOps lifecycle. It helps organizations to plan, build, secure, and deploy software to drive business outcomes. The company also provides related training and professional services. The company was formerly known as GitLab B.V. and changed its name to GitLab Inc. in July 2015. The company was founded in 2011 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Sytse  Sijbrandij",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2170",
    "phone": "415 829 2854",
    "address": "268 Bush Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94104",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/GTLB.png",
    "ipoDate": "2021-10-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "AA",
    "price": 23.51,
    "beta": 2.451,
    "volAvg": 5972015,
    "mktCap": 4195359500,
    "lastDiv": 0.4,
    "range": "23.07-57.609",
    "changes": 0.005,
    "companyName": "Alcoa Corporation",
    "currency": "USD",
    "cik": "0001675149",
    "isin": "US0138721065",
    "cusip": "013872106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aluminum",
    "website": "https://www.alcoa.com",
    "description": "Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through three segments: Bauxite, Alumina, and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1888 and is headquartered in Pittsburgh, Pennsylvania.",
    "ceo": "Mr. William F. Oplinger",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "13100",
    "phone": "412 315 2900",
    "address": "201 Isabella Street",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15212-5858",
    "dcfDiff": 3.63919,
    "dcf": 56.3892,
    "image": "https://financialmodelingprep.com/image-stock/AA.png",
    "ipoDate": "2016-11-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "AB",
    "price": 28.52,
    "beta": 1.311,
    "volAvg": 309173,
    "mktCap": 3235736600,
    "lastDiv": 2.61,
    "range": "27.58-42.0",
    "changes": -0.03,
    "companyName": "AllianceBernstein Holding L.P.",
    "currency": "USD",
    "cik": "0000825313",
    "isin": "US01881G1067",
    "cusip": "01881G106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.alliancebernstein.com",
    "description": "AllianceBernstein Holding L.P. is publicly owned investment manager. The firm also provides research services to its clients. It provides its services to investment companies, pension and profit sharing plans, banks and thrift institutions, trusts, estates, government agencies, charitable organizations, individuals, corporations, and other business entities. The firm invests in public equity, fixed income, and alternative investment markets across the globe. It employs long/short strategy to make its investments. The firm conducts in-house research to make its investments. AllianceBernstein Holding L.P. was founded in 1987 and is based in New York, New York.",
    "ceo": "Mr. Seth Perry Bernstein",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4436",
    "phone": "212-969-1000",
    "address": "1345 Avenue of the Americas",
    "city": "New York",
    "state": "NY",
    "zip": "10105",
    "dcfDiff": 2.14001,
    "dcf": 40,
    "image": "https://financialmodelingprep.com/image-stock/AB.png",
    "ipoDate": "1988-04-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "CC",
    "price": 23.58,
    "beta": 1.993,
    "volAvg": 1207526,
    "mktCap": 3491655471,
    "lastDiv": 1,
    "range": "22.88-39.05",
    "changes": -0.66,
    "companyName": "The Chemours Company",
    "currency": "USD",
    "cik": "0001627223",
    "isin": "US1638511089",
    "cusip": "163851108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.chemours.com",
    "description": "The Chemours Company provides performance chemicals in North America, the Asia Pacific, Europe, the Middle East, Africa, and Latin America. It operates through four segments: Titanium Technologies, Thermal & Specialized Solutions, Advanced Performance Materials, and Chemical Solutions. The Titanium Technologies segment provides TiO2 pigment under the Ti-Pure and BaiMax brands for delivering whiteness, brightness, opacity, and protection in various of applications, such as architectural and industrial coatings, flexible and rigid plastic packaging, polyvinylchloride, laminate papers used for furniture and building materials, coated paper, and coated paperboard used for packaging. The Thermal & Specialized Solutions segment offers of refrigerants, thermal management solutions, propellants, foam blowing agents, and specialty solvents. The Advanced Performance Materials segment products portfolio includes various industrial resins, specialty products, membranes, and coatings for consumer electronics, semiconductors, digital communications, transportation, energy, oil and gas, and medical, and others applications. The Chemical Solutions segment comprises a portfolio of industrial chemicals used as raw materials and catalysts for gold production, clean and disinfect, oil and gas, water treatment, electronics, and automotive applications. The company sells its products through direct and indirect channels, as well as through a network of resellers and distributors. The Chemours Company was founded in 2014 and is headquartered in Wilmington, Delaware.",
    "ceo": "Mr. Mark E. Newman",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "6600",
    "phone": "302 773 1000",
    "address": "1007 Market Street",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19899",
    "dcfDiff": 5.79275,
    "dcf": 40.8928,
    "image": "https://financialmodelingprep.com/image-stock/CC.png",
    "ipoDate": "2015-06-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "D",
    "price": 40.08,
    "beta": 0.516,
    "volAvg": 5399721,
    "mktCap": 33537861519,
    "lastDiv": 2.67,
    "range": "39.18-70.8",
    "changes": -0.89,
    "companyName": "Dominion Energy, Inc.",
    "currency": "USD",
    "cik": "0000715957",
    "isin": "US25746U1097",
    "cusip": "25746U109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities-Regulated Electric",
    "website": "https://www.dominionenergy.com",
    "description": "Dominion Energy, Inc. produces and distributes energy in the United States. The company operates through four segments: Dominion Energy Virginia, Gas Distribution, Dominion Energy South Carolina, and Contracted Assets. The Dominion Energy Virginia segment generates, transmits, and distributes regulated electricity to approximately 2.7 million residential, commercial, industrial, and governmental customers in Virginia and North Carolina. The Gas Distribution segment is involved in the regulated natural gas sales, transportation, gathering, storage, and distribution operations in Ohio, West Virginia, North Carolina, Utah, southwestern Wyoming, and southeastern Idaho that serve approximately 3.1 million residential, commercial and industrial customers. It also has nonregulated renewable natural gas facilities in operation. The Dominion Energy South Carolina segment generates, transmits, and distributes electricity to approximately 772,000 customers in the central, southern, and southwestern portions of South Carolina; and distributes natural gas to approximately 419,000 residential, commercial, and industrial customers in South Carolina. The Contracted Assets segment is involved in the nonregulated long-term contracted renewable electric generation and solar generation facility development operations; and gas transportation, LNG import, and storage operations, as well as in the liquefaction facility. As of December 31, 2021, the company's portfolio of assets included approximately 30.2 gigawatt of electric generating capacity; 10,700 miles of electric transmission lines; 78,000 miles of electric distribution lines; and 95,700 miles of gas distribution mains and related service facilities. The company was formerly known as Dominion Resources, Inc. Dominion Energy, Inc. was incorporated in 1983 and is headquartered in Richmond, Virginia.",
    "ceo": "Mr. Robert M. Blue",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "17200",
    "phone": "804-819-2000",
    "address": "120 Tredegar Street",
    "city": "Richmond",
    "state": "VA",
    "zip": "23219",
    "dcfDiff": 2.56062,
    "dcf": 59.8894,
    "image": "https://financialmodelingprep.com/image-stock/D.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]